susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32F302.h
/*
 * This file is automatically generated by afTable.py from the xml descriptions provided as part of the STM32Cube IDE
 * Timestamp: 2023-12-12T18:58:56.133898
 */

#ifndef LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION
#define LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION

#define CAN_RX_PA11_ PA11,GPIO_AF9
#define CAN_RX_PB8_ PB8,GPIO_AF9
#define _CAN_RX_PA11_ 1
#define _CAN_RX_PB8_ 1

#define CAN_TX_PA12_ PA12,GPIO_AF9
#define CAN_TX_PB9_ PB9,GPIO_AF9
#define _CAN_TX_PA12_ 1
#define _CAN_TX_PB9_ 1

#define COMP2_OUT_PA12_ PA12,GPIO_AF8
#define COMP2_OUT_PA2_ PA2,GPIO_AF8
#define COMP2_OUT_PB9_ PB9,GPIO_AF8
#define _COMP2_OUT_PA12_ 1
#define _COMP2_OUT_PA2_ 1
#define _COMP2_OUT_PB9_ 1

#define COMP4_OUT_PB1_ PB1,GPIO_AF8
#define _COMP4_OUT_PB1_ 1

#define COMP6_OUT_PA10_ PA10,GPIO_AF8
#define COMP6_OUT_PC6_ PC6,GPIO_AF7
#define _COMP6_OUT_PA10_ 1
#define _COMP6_OUT_PC6_ 1

#define EVENTOUT_PA0_ PA0,GPIO_AF15
#define EVENTOUT_PA1_ PA1,GPIO_AF15
#define EVENTOUT_PA10_ PA10,GPIO_AF15
#define EVENTOUT_PA11_ PA11,GPIO_AF15
#define EVENTOUT_PA12_ PA12,GPIO_AF15
#define EVENTOUT_PA13_ PA13,GPIO_AF15
#define EVENTOUT_PA14_ PA14,GPIO_AF15
#define EVENTOUT_PA15_ PA15,GPIO_AF15
#define EVENTOUT_PA2_ PA2,GPIO_AF15
#define EVENTOUT_PA3_ PA3,GPIO_AF15
#define EVENTOUT_PA4_ PA4,GPIO_AF15
#define EVENTOUT_PA5_ PA5,GPIO_AF15
#define EVENTOUT_PA6_ PA6,GPIO_AF15
#define EVENTOUT_PA7_ PA7,GPIO_AF15
#define EVENTOUT_PA8_ PA8,GPIO_AF15
#define EVENTOUT_PA9_ PA9,GPIO_AF15
#define EVENTOUT_PB0_ PB0,GPIO_AF15
#define EVENTOUT_PB1_ PB1,GPIO_AF15
#define EVENTOUT_PB10_ PB10,GPIO_AF15
#define EVENTOUT_PB11_ PB11,GPIO_AF15
#define EVENTOUT_PB12_ PB12,GPIO_AF15
#define EVENTOUT_PB13_ PB13,GPIO_AF15
#define EVENTOUT_PB14_ PB14,GPIO_AF15
#define EVENTOUT_PB15_ PB15,GPIO_AF15
#define EVENTOUT_PB2_ PB2,GPIO_AF15
#define EVENTOUT_PB3_ PB3,GPIO_AF15
#define EVENTOUT_PB4_ PB4,GPIO_AF15
#define EVENTOUT_PB5_ PB5,GPIO_AF15
#define EVENTOUT_PB6_ PB6,GPIO_AF15
#define EVENTOUT_PB7_ PB7,GPIO_AF15
#define EVENTOUT_PB8_ PB8,GPIO_AF15
#define EVENTOUT_PB9_ PB9,GPIO_AF15
#define EVENTOUT_PC0_ PC0,GPIO_AF1
#define EVENTOUT_PC1_ PC1,GPIO_AF1
#define EVENTOUT_PC10_ PC10,GPIO_AF1
#define EVENTOUT_PC11_ PC11,GPIO_AF1
#define EVENTOUT_PC12_ PC12,GPIO_AF1
#define EVENTOUT_PC2_ PC2,GPIO_AF1
#define EVENTOUT_PC3_ PC3,GPIO_AF1
#define EVENTOUT_PC4_ PC4,GPIO_AF1
#define EVENTOUT_PC5_ PC5,GPIO_AF1
#define EVENTOUT_PC6_ PC6,GPIO_AF1
#define EVENTOUT_PC7_ PC7,GPIO_AF1
#define EVENTOUT_PC8_ PC8,GPIO_AF1
#define EVENTOUT_PC9_ PC9,GPIO_AF1
#define EVENTOUT_PD2_ PD2,GPIO_AF1
#define _EVENTOUT_PA0_ 1
#define _EVENTOUT_PA1_ 1
#define _EVENTOUT_PA10_ 1
#define _EVENTOUT_PA11_ 1
#define _EVENTOUT_PA12_ 1
#define _EVENTOUT_PA13_ 1
#define _EVENTOUT_PA14_ 1
#define _EVENTOUT_PA15_ 1
#define _EVENTOUT_PA2_ 1
#define _EVENTOUT_PA3_ 1
#define _EVENTOUT_PA4_ 1
#define _EVENTOUT_PA5_ 1
#define _EVENTOUT_PA6_ 1
#define _EVENTOUT_PA7_ 1
#define _EVENTOUT_PA8_ 1
#define _EVENTOUT_PA9_ 1
#define _EVENTOUT_PB0_ 1
#define _EVENTOUT_PB1_ 1
#define _EVENTOUT_PB10_ 1
#define _EVENTOUT_PB11_ 1
#define _EVENTOUT_PB12_ 1
#define _EVENTOUT_PB13_ 1
#define _EVENTOUT_PB14_ 1
#define _EVENTOUT_PB15_ 1
#define _EVENTOUT_PB2_ 1
#define _EVENTOUT_PB3_ 1
#define _EVENTOUT_PB4_ 1
#define _EVENTOUT_PB5_ 1
#define _EVENTOUT_PB6_ 1
#define _EVENTOUT_PB7_ 1
#define _EVENTOUT_PB8_ 1
#define _EVENTOUT_PB9_ 1
#define _EVENTOUT_PC0_ 1
#define _EVENTOUT_PC1_ 1
#define _EVENTOUT_PC10_ 1
#define _EVENTOUT_PC11_ 1
#define _EVENTOUT_PC12_ 1
#define _EVENTOUT_PC2_ 1
#define _EVENTOUT_PC3_ 1
#define _EVENTOUT_PC4_ 1
#define _EVENTOUT_PC5_ 1
#define _EVENTOUT_PC6_ 1
#define _EVENTOUT_PC7_ 1
#define _EVENTOUT_PC8_ 1
#define _EVENTOUT_PC9_ 1
#define _EVENTOUT_PD2_ 1

#define I2C1_SCL_PA15_ PA15,GPIO_AF4
#define I2C1_SCL_PB6_ PB6,GPIO_AF4
#define I2C1_SCL_PB8_ PB8,GPIO_AF4
#define _I2C1_SCL_PA15_ 1
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1

#define I2C1_SDA_PA14_ PA14,GPIO_AF4
#define I2C1_SDA_PB7_ PB7,GPIO_AF4
#define I2C1_SDA_PB9_ PB9,GPIO_AF4
#define _I2C1_SDA_PA14_ 1
#define _I2C1_SDA_PB7_ 1
#define _I2C1_SDA_PB9_ 1

#define I2C1_SMBA_PB5_ PB5,GPIO_AF4
#define _I2C1_SMBA_PB5_ 1

#define I2C2_SCL_PA9_ PA9,GPIO_AF4
#define I2C2_SCL_PF1_ PF1,GPIO_AF4
#define _I2C2_SCL_PA9_ 1
#define _I2C2_SCL_PF1_ 1

#define I2C2_SDA_PA10_ PA10,GPIO_AF4
#define I2C2_SDA_PF0_ PF0,GPIO_AF4
#define _I2C2_SDA_PA10_ 1
#define _I2C2_SDA_PF0_ 1

#define I2C2_SMBA_PA8_ PA8,GPIO_AF4
#define I2C2_SMBA_PB12_ PB12,GPIO_AF4
#define _I2C2_SMBA_PA8_ 1
#define _I2C2_SMBA_PB12_ 1

#define I2C3_SCL_PA8_ PA8,GPIO_AF3
#define _I2C3_SCL_PA8_ 1

#define I2C3_SDA_PB5_ PB5,GPIO_AF8
#define I2C3_SDA_PC9_ PC9,GPIO_AF3
#define _I2C3_SDA_PB5_ 1
#define _I2C3_SDA_PC9_ 1

#define I2C3_SMBA_PA9_ PA9,GPIO_AF2
#define _I2C3_SMBA_PA9_ 1

#define I2S2_CK_PB13_ PB13,GPIO_AF5
#define I2S2_CK_PF1_ PF1,GPIO_AF5
#define _I2S2_CK_PB13_ 1
#define _I2S2_CK_PF1_ 1

#define I2S2_MCK_PA8_ PA8,GPIO_AF5
#define I2S2_MCK_PC6_ PC6,GPIO_AF6
#define _I2S2_MCK_PA8_ 1
#define _I2S2_MCK_PC6_ 1

#define I2S2_SD_PA11_ PA11,GPIO_AF5
#define I2S2_SD_PB15_ PB15,GPIO_AF5
#define _I2S2_SD_PA11_ 1
#define _I2S2_SD_PB15_ 1

#define I2S2_WS_PB12_ PB12,GPIO_AF5
#define I2S2_WS_PF0_ PF0,GPIO_AF5
#define _I2S2_WS_PB12_ 1
#define _I2S2_WS_PF0_ 1

#define I2S2_ext_SD_PA10_ PA10,GPIO_AF5
#define I2S2_ext_SD_PB14_ PB14,GPIO_AF5
#define _I2S2_ext_SD_PA10_ 1
#define _I2S2_ext_SD_PB14_ 1

#define I2S3_CK_PB3_ PB3,GPIO_AF6
#define I2S3_CK_PC10_ PC10,GPIO_AF6
#define _I2S3_CK_PB3_ 1
#define _I2S3_CK_PC10_ 1

#define I2S3_MCK_PA9_ PA9,GPIO_AF5
#define I2S3_MCK_PC7_ PC7,GPIO_AF6
#define _I2S3_MCK_PA9_ 1
#define _I2S3_MCK_PC7_ 1

#define I2S3_SD_PB5_ PB5,GPIO_AF6
#define I2S3_SD_PC12_ PC12,GPIO_AF6
#define _I2S3_SD_PB5_ 1
#define _I2S3_SD_PC12_ 1

#define I2S3_WS_PA15_ PA15,GPIO_AF6
#define I2S3_WS_PA4_ PA4,GPIO_AF6
#define _I2S3_WS_PA15_ 1
#define _I2S3_WS_PA4_ 1

#define I2S3_ext_SD_PB4_ PB4,GPIO_AF6
#define I2S3_ext_SD_PC11_ PC11,GPIO_AF6
#define _I2S3_ext_SD_PB4_ 1
#define _I2S3_ext_SD_PC11_ 1

#define I2S_CKIN_PA12_ PA12,GPIO_AF5
#define I2S_CKIN_PC9_ PC9,GPIO_AF5
#define _I2S_CKIN_PA12_ 1
#define _I2S_CKIN_PC9_ 1

#define IR_OUT_PA13_ PA13,GPIO_AF5
#define IR_OUT_PB9_ PB9,GPIO_AF6
#define _IR_OUT_PA13_ 1
#define _IR_OUT_PB9_ 1

#define RCC_MCO_PA8_ PA8,GPIO_AF0
#define _RCC_MCO_PA8_ 1

#define RTC_REFIN_PA1_ PA1,GPIO_AF0
#define RTC_REFIN_PB15_ PB15,GPIO_AF0
#define _RTC_REFIN_PA1_ 1
#define _RTC_REFIN_PB15_ 1

#define SPI2_MISO_PA10_ PA10,GPIO_AF5
#define SPI2_MISO_PB14_ PB14,GPIO_AF5
#define _SPI2_MISO_PA10_ 1
#define _SPI2_MISO_PB14_ 1

#define SPI2_MOSI_PA11_ PA11,GPIO_AF5
#define SPI2_MOSI_PB15_ PB15,GPIO_AF5
#define _SPI2_MOSI_PA11_ 1
#define _SPI2_MOSI_PB15_ 1

#define SPI2_NSS_PB12_ PB12,GPIO_AF5
#define SPI2_NSS_PF0_ PF0,GPIO_AF5
#define _SPI2_NSS_PB12_ 1
#define _SPI2_NSS_PF0_ 1

#define SPI2_SCK_PB13_ PB13,GPIO_AF5
#define SPI2_SCK_PF1_ PF1,GPIO_AF5
#define _SPI2_SCK_PB13_ 1
#define _SPI2_SCK_PF1_ 1

#define SPI3_MISO_PB4_ PB4,GPIO_AF6
#define SPI3_MISO_PC11_ PC11,GPIO_AF6
#define _SPI3_MISO_PB4_ 1
#define _SPI3_MISO_PC11_ 1

#define SPI3_MOSI_PB5_ PB5,GPIO_AF6
#define SPI3_MOSI_PC12_ PC12,GPIO_AF6
#define _SPI3_MOSI_PB5_ 1
#define _SPI3_MOSI_PC12_ 1

#define SPI3_NSS_PA15_ PA15,GPIO_AF6
#define SPI3_NSS_PA4_ PA4,GPIO_AF6
#define _SPI3_NSS_PA15_ 1
#define _SPI3_NSS_PA4_ 1

#define SPI3_SCK_PB3_ PB3,GPIO_AF6
#define SPI3_SCK_PC10_ PC10,GPIO_AF6
#define _SPI3_SCK_PB3_ 1
#define _SPI3_SCK_PC10_ 1

#define SYS_JTCK_SWCLK_PA14_ PA14,GPIO_AF0
#define _SYS_JTCK_SWCLK_PA14_ 1

#define SYS_JTDI_PA15_ PA15,GPIO_AF0
#define _SYS_JTDI_PA15_ 1

#define SYS_JTDO_TRACESWO_PB3_ PB3,GPIO_AF0
#define _SYS_JTDO_TRACESWO_PB3_ 1

#define SYS_JTMS_SWDIO_PA13_ PA13,GPIO_AF0
#define _SYS_JTMS_SWDIO_PA13_ 1

#define SYS_NJTRST_PB4_ PB4,GPIO_AF0
#define _SYS_NJTRST_PB4_ 1

#define TIM15_BKIN_PA9_ PA9,GPIO_AF9
#define TIM15_BKIN_PC5_ PC5,GPIO_AF2
#define _TIM15_BKIN_PA9_ 1
#define _TIM15_BKIN_PC5_ 1

#define TIM15_CH1_PA2_ PA2,GPIO_AF9
#define TIM15_CH1_PB14_ PB14,GPIO_AF1
#define _TIM15_CH1_PA2_ 1
#define _TIM15_CH1_PB14_ 1

#define TIM15_CH1N_PA1_ PA1,GPIO_AF9
#define TIM15_CH1N_PB15_ PB15,GPIO_AF2
#define _TIM15_CH1N_PA1_ 1
#define _TIM15_CH1N_PB15_ 1

#define TIM15_CH2_PA3_ PA3,GPIO_AF9
#define TIM15_CH2_PB15_ PB15,GPIO_AF1
#define _TIM15_CH2_PA3_ 1
#define _TIM15_CH2_PB15_ 1

#define TIM16_BKIN_PB5_ PB5,GPIO_AF1
#define _TIM16_BKIN_PB5_ 1

#define TIM16_CH1_PA12_ PA12,GPIO_AF1
#define TIM16_CH1_PA6_ PA6,GPIO_AF1
#define TIM16_CH1_PB4_ PB4,GPIO_AF1
#define TIM16_CH1_PB8_ PB8,GPIO_AF1
#define _TIM16_CH1_PA12_ 1
#define _TIM16_CH1_PA6_ 1
#define _TIM16_CH1_PB4_ 1
#define _TIM16_CH1_PB8_ 1

#define TIM16_CH1N_PA13_ PA13,GPIO_AF1
#define TIM16_CH1N_PB6_ PB6,GPIO_AF1
#define _TIM16_CH1N_PA13_ 1
#define _TIM16_CH1N_PB6_ 1

#define TIM17_BKIN_PA10_ PA10,GPIO_AF1
#define TIM17_BKIN_PB4_ PB4,GPIO_AF10
#define _TIM17_BKIN_PA10_ 1
#define _TIM17_BKIN_PB4_ 1

#define TIM17_CH1_PA7_ PA7,GPIO_AF1
#define TIM17_CH1_PB5_ PB5,GPIO_AF10
#define TIM17_CH1_PB9_ PB9,GPIO_AF1
#define _TIM17_CH1_PA7_ 1
#define _TIM17_CH1_PB5_ 1
#define _TIM17_CH1_PB9_ 1

#define TIM17_CH1N_PB7_ PB7,GPIO_AF1
#define _TIM17_CH1N_PB7_ 1

#define TIM1_BKIN_PA14_ PA14,GPIO_AF6
#define TIM1_BKIN_PA15_ PA15,GPIO_AF9
#define TIM1_BKIN_PA6_ PA6,GPIO_AF6
#define TIM1_BKIN_PB12_ PB12,GPIO_AF6
#define TIM1_BKIN_PB8_ PB8,GPIO_AF12
#define _TIM1_BKIN_PA14_ 1
#define _TIM1_BKIN_PA15_ 1
#define _TIM1_BKIN_PA6_ 1
#define _TIM1_BKIN_PB12_ 1
#define _TIM1_BKIN_PB8_ 1

#define TIM1_BKIN2_PA11_ PA11,GPIO_AF12
#define TIM1_BKIN2_PC3_ PC3,GPIO_AF6
#define _TIM1_BKIN2_PA11_ 1
#define _TIM1_BKIN2_PC3_ 1

#define TIM1_CH1_PA8_ PA8,GPIO_AF6
#define TIM1_CH1_PC0_ PC0,GPIO_AF2
#define _TIM1_CH1_PA8_ 1
#define _TIM1_CH1_PC0_ 1

#define TIM1_CH1N_PA11_ PA11,GPIO_AF6
#define TIM1_CH1N_PA7_ PA7,GPIO_AF6
#define TIM1_CH1N_PB13_ PB13,GPIO_AF6
#define TIM1_CH1N_PC13_ PC13,GPIO_AF4
#define _TIM1_CH1N_PA11_ 1
#define _TIM1_CH1N_PA7_ 1
#define _TIM1_CH1N_PB13_ 1
#define _TIM1_CH1N_PC13_ 1

#define TIM1_CH2_PA9_ PA9,GPIO_AF6
#define TIM1_CH2_PC1_ PC1,GPIO_AF2
#define _TIM1_CH2_PA9_ 1
#define _TIM1_CH2_PC1_ 1

#define TIM1_CH2N_PA12_ PA12,GPIO_AF6
#define TIM1_CH2N_PB0_ PB0,GPIO_AF6
#define TIM1_CH2N_PB14_ PB14,GPIO_AF6
#define _TIM1_CH2N_PA12_ 1
#define _TIM1_CH2N_PB0_ 1
#define _TIM1_CH2N_PB14_ 1

#define TIM1_CH3_PA10_ PA10,GPIO_AF6
#define TIM1_CH3_PC2_ PC2,GPIO_AF2
#define _TIM1_CH3_PA10_ 1
#define _TIM1_CH3_PC2_ 1

#define TIM1_CH3N_PB1_ PB1,GPIO_AF6
#define TIM1_CH3N_PB15_ PB15,GPIO_AF4
#define TIM1_CH3N_PF0_ PF0,GPIO_AF6
#define _TIM1_CH3N_PB1_ 1
#define _TIM1_CH3N_PB15_ 1
#define _TIM1_CH3N_PF0_ 1

#define TIM1_CH4_PA11_ PA11,GPIO_AF11
#define TIM1_CH4_PC3_ PC3,GPIO_AF2
#define _TIM1_CH4_PA11_ 1
#define _TIM1_CH4_PC3_ 1

#define TIM1_ETR_PA12_ PA12,GPIO_AF11
#define TIM1_ETR_PC4_ PC4,GPIO_AF2
#define _TIM1_ETR_PA12_ 1
#define _TIM1_ETR_PC4_ 1

#define TIM2_CH1_PA0_ PA0,GPIO_AF1
#define TIM2_CH1_PA15_ PA15,GPIO_AF1
#define TIM2_CH1_PA5_ PA5,GPIO_AF1
#define _TIM2_CH1_PA0_ 1
#define _TIM2_CH1_PA15_ 1
#define _TIM2_CH1_PA5_ 1

#define TIM2_CH2_PA1_ PA1,GPIO_AF1
#define TIM2_CH2_PB3_ PB3,GPIO_AF1
#define _TIM2_CH2_PA1_ 1
#define _TIM2_CH2_PB3_ 1

#define TIM2_CH3_PA2_ PA2,GPIO_AF1
#define TIM2_CH3_PA9_ PA9,GPIO_AF10
#define TIM2_CH3_PB10_ PB10,GPIO_AF1
#define _TIM2_CH3_PA2_ 1
#define _TIM2_CH3_PA9_ 1
#define _TIM2_CH3_PB10_ 1

#define TIM2_CH4_PA10_ PA10,GPIO_AF10
#define TIM2_CH4_PA3_ PA3,GPIO_AF1
#define TIM2_CH4_PB11_ PB11,GPIO_AF1
#define _TIM2_CH4_PA10_ 1
#define _TIM2_CH4_PA3_ 1
#define _TIM2_CH4_PB11_ 1

#define TIM2_ETR_PA0_ PA0,GPIO_AF1
#define TIM2_ETR_PA15_ PA15,GPIO_AF1
#define TIM2_ETR_PA5_ PA5,GPIO_AF1
#define _TIM2_ETR_PA0_ 1
#define _TIM2_ETR_PA15_ 1
#define _TIM2_ETR_PA5_ 1

#define TSC_G1_IO1_PA0_ PA0,GPIO_AF3
#define _TSC_G1_IO1_PA0_ 1

#define TSC_G1_IO2_PA1_ PA1,GPIO_AF3
#define _TSC_G1_IO2_PA1_ 1

#define TSC_G1_IO3_PA2_ PA2,GPIO_AF3
#define _TSC_G1_IO3_PA2_ 1

#define TSC_G1_IO4_PA3_ PA3,GPIO_AF3
#define _TSC_G1_IO4_PA3_ 1

#define TSC_G2_IO1_PA4_ PA4,GPIO_AF3
#define _TSC_G2_IO1_PA4_ 1

#define TSC_G2_IO2_PA5_ PA5,GPIO_AF3
#define _TSC_G2_IO2_PA5_ 1

#define TSC_G2_IO3_PA6_ PA6,GPIO_AF3
#define _TSC_G2_IO3_PA6_ 1

#define TSC_G2_IO4_PA7_ PA7,GPIO_AF3
#define _TSC_G2_IO4_PA7_ 1

#define TSC_G3_IO1_PC5_ PC5,GPIO_AF3
#define _TSC_G3_IO1_PC5_ 1

#define TSC_G3_IO2_PB0_ PB0,GPIO_AF3
#define _TSC_G3_IO2_PB0_ 1

#define TSC_G3_IO3_PB1_ PB1,GPIO_AF3
#define _TSC_G3_IO3_PB1_ 1

#define TSC_G3_IO4_PB2_ PB2,GPIO_AF3
#define _TSC_G3_IO4_PB2_ 1

#define TSC_G4_IO1_PA9_ PA9,GPIO_AF3
#define _TSC_G4_IO1_PA9_ 1

#define TSC_G4_IO2_PA10_ PA10,GPIO_AF3
#define _TSC_G4_IO2_PA10_ 1

#define TSC_G4_IO3_PA13_ PA13,GPIO_AF3
#define _TSC_G4_IO3_PA13_ 1

#define TSC_G4_IO4_PA14_ PA14,GPIO_AF3
#define _TSC_G4_IO4_PA14_ 1

#define TSC_G5_IO1_PB3_ PB3,GPIO_AF3
#define _TSC_G5_IO1_PB3_ 1

#define TSC_G5_IO2_PB4_ PB4,GPIO_AF3
#define _TSC_G5_IO2_PB4_ 1

#define TSC_G5_IO3_PB6_ PB6,GPIO_AF3
#define _TSC_G5_IO3_PB6_ 1

#define TSC_G5_IO4_PB7_ PB7,GPIO_AF3
#define _TSC_G5_IO4_PB7_ 1

#define TSC_G6_IO1_PB11_ PB11,GPIO_AF3
#define _TSC_G6_IO1_PB11_ 1

#define TSC_G6_IO2_PB12_ PB12,GPIO_AF3
#define _TSC_G6_IO2_PB12_ 1

#define TSC_G6_IO3_PB13_ PB13,GPIO_AF3
#define _TSC_G6_IO3_PB13_ 1

#define TSC_G6_IO4_PB14_ PB14,GPIO_AF3
#define _TSC_G6_IO4_PB14_ 1

#define TSC_SYNC_PA15_ PA15,GPIO_AF3
#define TSC_SYNC_PB10_ PB10,GPIO_AF3
#define TSC_SYNC_PB8_ PB8,GPIO_AF3
#define _TSC_SYNC_PA15_ 1
#define _TSC_SYNC_PB10_ 1
#define _TSC_SYNC_PB8_ 1

#define UART1_CK_PA8_ PA8,GPIO_AF7
#define _UART1_CK_PA8_ 1

#define UART1_CTS_PA11_ PA11,GPIO_AF7
#define _UART1_CTS_PA11_ 1

#define UART1_DE_PA12_ PA12,GPIO_AF7
#define _UART1_DE_PA12_ 1

#define UART1_RTS_PA12_ PA12,GPIO_AF7
#define _UART1_RTS_PA12_ 1

#define UART1_RX_PA10_ PA10,GPIO_AF7
#define UART1_RX_PB7_ PB7,GPIO_AF7
#define UART1_RX_PC5_ PC5,GPIO_AF7
#define _UART1_RX_PA10_ 1
#define _UART1_RX_PB7_ 1
#define _UART1_RX_PC5_ 1

#define UART1_TX_PA9_ PA9,GPIO_AF7
#define UART1_TX_PB6_ PB6,GPIO_AF7
#define UART1_TX_PC4_ PC4,GPIO_AF7
#define _UART1_TX_PA9_ 1
#define _UART1_TX_PB6_ 1
#define _UART1_TX_PC4_ 1

#define UART2_CK_PA4_ PA4,GPIO_AF7
#define UART2_CK_PB5_ PB5,GPIO_AF7
#define _UART2_CK_PA4_ 1
#define _UART2_CK_PB5_ 1

#define UART2_CTS_PA0_ PA0,GPIO_AF7
#define _UART2_CTS_PA0_ 1

#define UART2_DE_PA1_ PA1,GPIO_AF7
#define _UART2_DE_PA1_ 1

#define UART2_RTS_PA1_ PA1,GPIO_AF7
#define _UART2_RTS_PA1_ 1

#define UART2_RX_PA15_ PA15,GPIO_AF7
#define UART2_RX_PA3_ PA3,GPIO_AF7
#define UART2_RX_PB4_ PB4,GPIO_AF7
#define _UART2_RX_PA15_ 1
#define _UART2_RX_PA3_ 1
#define _UART2_RX_PB4_ 1

#define UART2_TX_PA14_ PA14,GPIO_AF7
#define UART2_TX_PA2_ PA2,GPIO_AF7
#define UART2_TX_PB3_ PB3,GPIO_AF7
#define _UART2_TX_PA14_ 1
#define _UART2_TX_PA2_ 1
#define _UART2_TX_PB3_ 1

#define UART3_CK_PB12_ PB12,GPIO_AF7
#define UART3_CK_PC12_ PC12,GPIO_AF7
#define _UART3_CK_PB12_ 1
#define _UART3_CK_PC12_ 1

#define UART3_CTS_PA13_ PA13,GPIO_AF7
#define UART3_CTS_PB13_ PB13,GPIO_AF7
#define _UART3_CTS_PA13_ 1
#define _UART3_CTS_PB13_ 1

#define UART3_DE_PB14_ PB14,GPIO_AF7
#define _UART3_DE_PB14_ 1

#define UART3_RTS_PB14_ PB14,GPIO_AF7
#define _UART3_RTS_PB14_ 1

#define UART3_RX_PB11_ PB11,GPIO_AF7
#define UART3_RX_PB8_ PB8,GPIO_AF7
#define UART3_RX_PC11_ PC11,GPIO_AF7
#define _UART3_RX_PB11_ 1
#define _UART3_RX_PB8_ 1
#define _UART3_RX_PC11_ 1

#define UART3_TX_PB10_ PB10,GPIO_AF7
#define UART3_TX_PB9_ PB9,GPIO_AF7
#define UART3_TX_PC10_ PC10,GPIO_AF7
#define _UART3_TX_PB10_ 1
#define _UART3_TX_PB9_ 1
#define _UART3_TX_PC10_ 1

#define USART1_CK_PA8_ PA8,GPIO_AF7
#define _USART1_CK_PA8_ 1

#define USART1_CTS_PA11_ PA11,GPIO_AF7
#define _USART1_CTS_PA11_ 1

#define USART1_DE_PA12_ PA12,GPIO_AF7
#define _USART1_DE_PA12_ 1

#define USART1_RTS_PA12_ PA12,GPIO_AF7
#define _USART1_RTS_PA12_ 1

#define USART1_RX_PA10_ PA10,GPIO_AF7
#define USART1_RX_PB7_ PB7,GPIO_AF7
#define USART1_RX_PC5_ PC5,GPIO_AF7
#define _USART1_RX_PA10_ 1
#define _USART1_RX_PB7_ 1
#define _USART1_RX_PC5_ 1

#define USART1_TX_PA9_ PA9,GPIO_AF7
#define USART1_TX_PB6_ PB6,GPIO_AF7
#define USART1_TX_PC4_ PC4,GPIO_AF7
#define _USART1_TX_PA9_ 1
#define _USART1_TX_PB6_ 1
#define _USART1_TX_PC4_ 1

#define USART2_CK_PA4_ PA4,GPIO_AF7
#define USART2_CK_PB5_ PB5,GPIO_AF7
#define _USART2_CK_PA4_ 1
#define _USART2_CK_PB5_ 1

#define USART2_CTS_PA0_ PA0,GPIO_AF7
#define _USART2_CTS_PA0_ 1

#define USART2_DE_PA1_ PA1,GPIO_AF7
#define _USART2_DE_PA1_ 1

#define USART2_RTS_PA1_ PA1,GPIO_AF7
#define _USART2_RTS_PA1_ 1

#define USART2_RX_PA15_ PA15,GPIO_AF7
#define USART2_RX_PA3_ PA3,GPIO_AF7
#define USART2_RX_PB4_ PB4,GPIO_AF7
#define _USART2_RX_PA15_ 1
#define _USART2_RX_PA3_ 1
#define _USART2_RX_PB4_ 1

#define USART2_TX_PA14_ PA14,GPIO_AF7
#define USART2_TX_PA2_ PA2,GPIO_AF7
#define USART2_TX_PB3_ PB3,GPIO_AF7
#define _USART2_TX_PA14_ 1
#define _USART2_TX_PA2_ 1
#define _USART2_TX_PB3_ 1

#define USART3_CK_PB12_ PB12,GPIO_AF7
#define USART3_CK_PC12_ PC12,GPIO_AF7
#define _USART3_CK_PB12_ 1
#define _USART3_CK_PC12_ 1

#define USART3_CTS_PA13_ PA13,GPIO_AF7
#define USART3_CTS_PB13_ PB13,GPIO_AF7
#define _USART3_CTS_PA13_ 1
#define _USART3_CTS_PB13_ 1

#define USART3_DE_PB14_ PB14,GPIO_AF7
#define _USART3_DE_PB14_ 1

#define USART3_RTS_PB14_ PB14,GPIO_AF7
#define _USART3_RTS_PB14_ 1

#define USART3_RX_PB11_ PB11,GPIO_AF7
#define USART3_RX_PB8_ PB8,GPIO_AF7
#define USART3_RX_PC11_ PC11,GPIO_AF7
#define _USART3_RX_PB11_ 1
#define _USART3_RX_PB8_ 1
#define _USART3_RX_PC11_ 1

#define USART3_TX_PB10_ PB10,GPIO_AF7
#define USART3_TX_PB9_ PB9,GPIO_AF7
#define USART3_TX_PC10_ PC10,GPIO_AF7
#define _USART3_TX_PB10_ 1
#define _USART3_TX_PB9_ 1
#define _USART3_TX_PC10_ 1

#endif /* LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION */